#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/delca85-org/gh-actions-demo/runs/run-oANwgi1GDYfQPS7p

Waiting for the plan to start...

Terraform v1.0.6
on linux_amd64
Configuring remote state backend...
Initializing Terraform configuration...
aws_sqs_queue.sqs[0]: Refreshing state... [id=https://sqs.eu-west-3.amazonaws.com/161959740628/master-terraform-sqs]
aws_sqs_queue.sqs[2]: Refreshing state... [id=https://sqs.eu-west-3.amazonaws.com/161959740628/gsl-try-action-terraform-sqs]
aws_sqs_queue.sqs[1]: Refreshing state... [id=https://sqs.eu-west-3.amazonaws.com/161959740628/master2-terraform-sqs]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_sqs_queue.sqs[2] has been changed
  ~ resource "aws_sqs_queue" "sqs" {
        id                                = "https://sqs.eu-west-3.amazonaws.com/161959740628/gsl-try-action-terraform-sqs"
        name                              = "gsl-try-action-terraform-sqs"
      + tags                              = {}
        # (11 unchanged attributes hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_sqs_queue.sqs[0] must be replaced
-/+ resource "aws_sqs_queue" "sqs" {
      ~ arn                               = "arn:aws:sqs:eu-west-3:161959740628:master-terraform-sqs" -> (known after apply)
      + deduplication_scope               = (known after apply)
      + fifo_throughput_limit             = (known after apply)
      ~ id                                = "https://sqs.eu-west-3.amazonaws.com/161959740628/master-terraform-sqs" -> (known after apply)
      ~ kms_data_key_reuse_period_seconds = 300 -> (known after apply)
      ~ name                              = "master-terraform-sqs" -> "gsl-again-terraform-sqs" # forces replacement
      + name_prefix                       = (known after apply)
      + policy                            = (known after apply)
      - tags                              = {} -> null
      ~ tags_all                          = {} -> (known after apply)
      ~ url                               = "https://sqs.eu-west-3.amazonaws.com/161959740628/master-terraform-sqs" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # aws_sqs_queue.sqs[1] will be destroyed
  - resource "aws_sqs_queue" "sqs" {
      - arn                               = "arn:aws:sqs:eu-west-3:161959740628:master2-terraform-sqs" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 0 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.eu-west-3.amazonaws.com/161959740628/master2-terraform-sqs" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 345600 -> null
      - name                              = "master2-terraform-sqs" -> null
      - receive_wait_time_seconds         = 0 -> null
      - tags                              = {} -> null
      - tags_all                          = {} -> null
      - url                               = "https://sqs.eu-west-3.amazonaws.com/161959740628/master2-terraform-sqs" -> null
      - visibility_timeout_seconds        = 30 -> null
    }

  # aws_sqs_queue.sqs[2] will be destroyed
  - resource "aws_sqs_queue" "sqs" {
      - arn                               = "arn:aws:sqs:eu-west-3:161959740628:gsl-try-action-terraform-sqs" -> null
      - content_based_deduplication       = false -> null
      - delay_seconds                     = 0 -> null
      - fifo_queue                        = false -> null
      - id                                = "https://sqs.eu-west-3.amazonaws.com/161959740628/gsl-try-action-terraform-sqs" -> null
      - kms_data_key_reuse_period_seconds = 300 -> null
      - max_message_size                  = 262144 -> null
      - message_retention_seconds         = 345600 -> null
      - name                              = "gsl-try-action-terraform-sqs" -> null
      - receive_wait_time_seconds         = 0 -> null
      - tags                              = {} -> null
      - tags_all                          = {} -> null
      - url                               = "https://sqs.eu-west-3.amazonaws.com/161959740628/gsl-try-action-terraform-sqs" -> null
      - visibility_timeout_seconds        = 30 -> null
    }

Plan: 1 to add, 0 to change, 3 to destroy.

```

</details>

*Pusher: @delca85, Action: `pull_request`*